HA_1C/DataProcessors/НастройкиПрограммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>НастройкиПрограммы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

HA_1C/InformationRegisters/ПринадлежностьФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПринадлежностьФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрикрепленныйФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрикрепленныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

HA_1C/DataProcessors/НастройкиПрограммы/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	ОбновлениеИнформационнойБазыВызовСервера.ПервоначальноеЗаполнениеБазы();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛишниеФото(Команда)
	ОчиститьЛишниеФотоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СинхронизоватьСДругимУстройством(Команда)
	ОткрытьФорму("Обработка.НастройкиПрограммы.Форма.СинхронизацияЧерезФайлы");
КонецПроцедуры

&НаКлиенте
Процедура ДелатьФотоАндроидАПИПриИзменении(Элемент)
	ЗаписатьКонстанту();
КонецПроцедуры

&НаКлиенте
Процедура КаталогФотоПриИзменении(Элемент)
	ЗаписатьКонстанту();
КонецПроцедуры

&НаКлиенте
Процедура КаталогКартинокПриИзменении(Элемент)
	ЗаписатьКонстанту();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьHA_Paint(Команда)
	
	ИНсталятор = РаспаковатьИнсталлятор();
	
	ПутьКПриложению = ПолучитьИмяВременногоФайла(".apk");
	ИНсталятор.Записать(ПутьКПриложению);
	
	ЗапуститьПриложение(ПутьКПриложению,, Истина);
	
	//УдалитьФайлы(ПутьКПриложению);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РаспаковатьИнсталлятор()
	
	Возврат Обработки.НастройкиПрограммы.ПолучитьМакет("HA_Paint");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОчиститьЛишниеФотоНаСервере()
	
	Перем НайденныеСсылки;
	
	УстановитьМонопольныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПринадлежностьФайлов.ПрикрепленныйФайл КАК ПрикрепленныйФайл,
	|	ПрикрепленныеФайлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПринадлежностьФайлов КАК ПринадлежностьФайлов
	|		ПО ПринадлежностьФайлов.ПрикрепленныйФайл = ПрикрепленныеФайлы.Ссылка
	|ГДЕ
	|	ПринадлежностьФайлов.ПрикрепленныйФайл ЕСТЬ NULL");
	
	ФайлыДляУдаления = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	УдалитьОбъекты(ФайлыДляУдаления, Истина, НайденныеСсылки);
	
	Если ЗначениеЗаполнено(НайденныеСсылки) Тогда
		Сообщить(НСтр("ru = 'Не все файлы были удалены. Список пропущенных Файлов:'; en = 'Some files was not deleted. Skipped files:'"));
		Для каждого ПропущенныйФайл Из НайденныеСсылки Цикл
			Сообщить(ПропущенныйФайл[0]);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонстанту()
	
	КонстантыОб = РеквизитФормыВЗначение("НаборКонстант");
	КонстантыОб.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьДублиНаСервере()
	Обработки.НастройкиПрограммы.УдалитьДублиПредопределенныхБезСсылок();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДубли(Команда)
	УдалитьДублиНаСервере();
КонецПроцедуры

#КонецОбласти
